{
  "entries": [
    {
      "id": 1,
      "date": "07/05/2022",
      "concept": "Orientation",
      "entry": "Today was the first day of class, I can't wait to learn JavaScript",
      "mood": "Confident",
      "language": "n/a"
    },
    {
      "id": 2,
      "date": "07/09/2022",
      "concept": "Client-Side Demos",
      "entry": "Watched the student's from a graduating cohort present their capstones, it was interesting getting to see what I'll be learning to do over the next six months",
      "mood": "Happy",
      "language": "n/a"
    },
    {
      "id": 3,
      "date": "07/16/2022",
      "concept": "GitHub Demos",
      "entry": "Watched a demonstration on how to use GitHub from the terminal, it seems like a lot but I know I'll be repeating it enough to make it easier to remember",
      "mood": "Nervous",
      "language": "HTML/CSS"
    },
    {
      "id": 4,
      "date": "07/23/2022",
      "concept": "Group Project Part 1",
      "entry": "Today we got together and planned out our first group project. We are going to be doing a website about our favorite video games.",
      "mood": "Happy",
      "language": "HTML/CSS"
    },
    {
      "id": 5,
      "date": "07/30/2022",
      "concept": "Group Project Presentation",
      "entry": "Today we presented our website. It was good but I definitley felt like I could have put more creativity into my website. I'd like to take that and put it into my next project",
      "mood": "Nervous",
      "language": "HTML/CSS"
    },
    {
      "id": 6,
      "date": "08/01/2022",
      "concept": "JavaScript Intro Part 1",
      "entry": "Today we practiced our first bit of JavaScript in class such as arrays and for of loops. It was tough at first but I think I'm figuring it out",
      "mood": "Confident",
      "language": "Javascript"
    },
    {
      "id": 7,
      "date": "08/02/2022",
      "concept": "JavaScript Intro Part 2",
      "entry": "Lynn demonstrated some more complex formulas in JavaScript, and really had me scratching my head for a while. I think I have a very basic understanding of it, but I definitley need more practice.",
      "mood": "Nervous",
      "language": "Javascript"
    },
    {
      "date": "2022-10-01",
      "concept": "k",
      "entry": "k            ",
      "mood": "Happy",
      "id": 8
    }
  ]
}