{
  "users": [
    {
      "id": 1,
      "name": "Kyle Bennett",
      "email": "kyle@gmail.com"
    },
    {
      "id": 2,
      "name": "Test",
      "email": "test@gmail.com"
    }
  ],
  "recipes": [
    {
      "userId": 2,
      "name": "Burgers",
      "ingredients": "Beef, buns, and cheese",
      "instructions": "Cook the burger, add buns and cheese",
      "typeId": 3,
      "id": 6
    },
    {
      "userId": 1,
      "name": "Sausage Pie Hello",
      "ingredients": "2 cans of crescent rolls, 1 lb ground sausage, 1 bag shredded cheddar",
      "instructions": "In your pan, spray non stick spray on the bottom or side. Roll one of the crescent rolls in the bottom of the pan for the crust Fry the sausage and drain the fat. Spread over the crescent roll Cover the sausage with cheese. Open the other can of rolls and put on top of the cheese Bake until 375 until the top is golden brown (about 20 minutes or so)",
      "typeId": 2,
      "id": 8
    },
    {
      "userId": 1,
      "name": "Meat Loaf",
      "ingredients": "1.5 lb ground beef, 1 egg, 1 small yellow onion chopped, 1 cup milk, 1 cup dried bread crumbs, salt and pepper, 1/3 cup ketchup, 2 tablespoons brown sugar, 2 tablespoons mustard",
      "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 9x5-inch loaf pan. Combine ground beef, onion, milk, bread crumbs and egg in a large bowl; season with salt and pepper. Transfer into prepared loaf pan. Mix ketchup, brown sugar, and mustard together in a small bowl until well combined; pour over meatloaf and spread it evenly over the top Bake in the preheated oven until no longer pink in the center, about 1 hour.",
      "typeId": "3",
      "id": 9
    },
    {
      "userId": 1,
      "name": "Open Faced Sloppy Joes",
      "ingredients": "1 lb ground beef; 1 small yellow onion, chopped; ⅓ c ketchup (I just drizzle it over); ½ can evaporated milk; Salt and pepper",
      "instructions": "Brown beef and onions in a skillet over medium-high heat. Drain the grease, lower heat to low and pour in the ketchup and evaporated milk. Add salt and pepper to taste. Stir together and heat until bubbly Serve open faced on a piece of bread with mayonnaise spread, and top with pickles",
      "typeId": 2,
      "id": 10
    },
    {
      "userId": 1,
      "name": "Homemade Chili",
      "ingredients": "2 lbs ground turkey or beef; 1 tablespoon minced garlic; ¼ cup diced onion; 6oz tomato paste; 15oz tomato sauce; 15oz kidney beans; 15oz chili mild beans; 7oz diced tomatoes; 2 tablespoons chili powder; 2 tablespoons garlic powder; 2 tablespoons onion powder; 2 tablespoons sugar; 1 teaspoon garlic salt; 1 teaspoon salt; 1 teaspoon pepper; ½ teaspoon cumin",
      "instructions": "Brown meat with the minced garlic and diced onion Add in the tomato paste, tomato sauce, beans, and tomatoes Add in the chili powder, garlic powder, onion powder, sugar, garlic salt, pepper, salt, and cumin Mix & mix & mix Simmer on low for 20 minutes with the lid on",
      "typeId": 3,
      "id": 11
    }
  ],
  "type": [
    {
      "id": 1,
      "mealType": "Breakfast"
    },
    {
      "id": 2,
      "mealType": "Lunch"
    },
    {
      "id": 3,
      "mealType": "Dinner"
    }
  ],
  "favoriteRecipe": [
    {
      "userId": 1,
      "id": 1,
      "recipeId": 8
    }
  ]
}